; domain
(define (domain zeno-travel)
(:requirements :typing :negative-preconditions)
(:types aircraft person city flevel - object)
(:predicates (at ?x - person  ?c - city )
             (at_aircraft ?x - aircraft ?c - city)
             (in ?p - person ?a - aircraft)
	         (fuel-level ?a - aircraft ?l - flevel)
	         (next ?l1 ?l2 - flevel))


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)

 :precondition (and (at ?p ?c)
                 (at_aircraft ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)))

(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)

 :precondition (and (in ?p ?a)
                 (at_aircraft ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)))

(:action fly
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 - flevel)

 :precondition (and (at_aircraft ?a ?c1)
                 (fuel-level ?a ?l1)
		 (next ?l2 ?l1))
 :effect (and (not (at_aircraft ?a ?c1))
              (at_aircraft ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l2)))

(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 ?l3 - flevel)

 :precondition (and (at_aircraft ?a ?c1)
                 (fuel-level ?a ?l1)
		 (next ?l2 ?l1)
		 (next ?l3 ?l2)
		)
 :effect (and (not (at_aircraft ?a ?c1))
              (at_aircraft ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l3)
	)
)

(:action refuel
 :parameters (?a - aircraft ?c - city ?l - flevel ?l1 - flevel)

 :precondition (and (fuel-level ?a ?l)
                 (next ?l ?l1)
                 (at_aircraft ?a ?c))
 :effect (and (fuel-level ?a ?l1) (not (fuel-level ?a ?l))))
)

; problem
(define (problem ZTRAVEL-5-40)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	person28 - person
	person29 - person
	person30 - person
	person31 - person
	person32 - person
	person33 - person
	person34 - person
	person35 - person
	person36 - person
	person37 - person
	person38 - person
	person39 - person
	person40 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at_aircraft plane1 city0)
	(fuel-level plane1 fl2)
	(at_aircraft plane2 city3)
	(fuel-level plane2 fl2)
	(at_aircraft plane3 city7)
	(fuel-level plane3 fl4)
	(at_aircraft plane4 city1)
	(fuel-level plane4 fl3)
	(at_aircraft plane5 city5)
	(fuel-level plane5 fl4)
	(at person1 city0)
	(at person2 city5)
	(at person3 city5)
	(at person4 city6)
	(at person5 city1)
	(at person6 city8)
	(at person7 city8)
	(at person8 city2)
	(at person9 city4)
	(at person10 city1)
	(at person11 city2)
	(at person12 city2)
	(at person13 city3)
	(at person14 city2)
	(at person15 city7)
	(at person16 city8)
	(at person17 city5)
	(at person18 city7)
	(at person19 city3)
	(at person20 city3)
	(at person21 city3)
	(at person22 city9)
	(at person23 city6)
	(at person24 city1)
	(at person25 city2)
	(at person26 city0)
	(at person27 city9)
	(at person28 city4)
	(at person29 city7)
	(at person30 city7)
	(at person31 city2)
	(at person32 city2)
	(at person33 city3)
	(at person34 city9)
	(at person35 city7)
	(at person36 city8)
	(at person37 city2)
	(at person38 city6)
	(at person39 city3)
	(at person40 city8)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at_aircraft plane1 city8)
	(at_aircraft plane3 city4)
	(at person2 city1)
	(at person3 city8)
	(at person4 city4)
	(at person5 city8)
	(at person6 city0)
	(at person7 city6)
	(at person8 city8)
	(at person9 city6)
	(at person10 city4)
	(at person11 city5)
	(at person12 city0)
	(at person13 city5)
	(at person15 city3)
	(at person16 city1)
	(at person17 city0)
	(at person18 city2)
	(at person19 city7)
	(at person20 city9)
	(at person22 city4)
	(at person23 city7)
	(at person24 city9)
	(at person25 city7)
	(at person26 city5)
	(at person27 city1)
	(at person28 city9)
	(at person29 city2)
	(at person30 city6)
	(at person31 city9)
	(at person32 city9)
	(at person33 city5)
	(at person34 city7)
	(at person35 city9)
	(at person36 city0)
	(at person37 city9)
	(at person38 city3)
	(at person39 city1)
	(at person40 city8)
	))

)

; plan
1. (fly plane5 city5 city0 fl4 fl3)
   deleted: (at_aircraft plane5 city5) (fuel-level plane5 fl4)
   added: (at_aircraft plane5 city0) (fuel-level plane5 fl3)
   goals met: 1 of 39
2. (board person26 plane5 city0)
   deleted: (at person26 city0)
   added: (in person26 plane5)
   goals met: 1 of 39
3. (fly plane4 city1 city4 fl3 fl2)
   deleted: (at_aircraft plane4 city1) (fuel-level plane4 fl3)
   added: (at_aircraft plane4 city4) (fuel-level plane4 fl2)
   goals met: 1 of 39
4. (board person9 plane4 city4)
   deleted: (at person9 city4)
   added: (in person9 plane4)
   goals met: 1 of 39
5. (board person28 plane4 city4)
   deleted: (at person28 city4)
   added: (in person28 plane4)
   goals met: 1 of 39
6. (fly plane3 city7 city3 fl4 fl3)
   deleted: (at_aircraft plane3 city7) (fuel-level plane3 fl4)
   added: (at_aircraft plane3 city3) (fuel-level plane3 fl3)
   goals met: 1 of 39
7. (board person39 plane3 city3)
   deleted: (at person39 city3)
   added: (in person39 plane3)
   goals met: 1 of 39
8. (fly plane3 city3 city1 fl3 fl2)
   deleted: (at_aircraft plane3 city3) (fuel-level plane3 fl3)
   added: (at_aircraft plane3 city1) (fuel-level plane3 fl2)
   goals met: 1 of 39
9. (board person5 plane3 city1)
   deleted: (at person5 city1)
   added: (in person5 plane3)
   goals met: 1 of 39
10. (debark person39 plane3 city1)
   deleted: (in person39 plane3)
   added: (at person39 city1)
   goals met: 2 of 39
11. (board person24 plane3 city1)
   deleted: (at person24 city1)
   added: (in person24 plane3)
   goals met: 2 of 39
12. (board person10 plane3 city1)
   deleted: (at person10 city1)
   added: (in person10 plane3)
   goals met: 2 of 39
13. (board person33 plane2 city3)
   deleted: (at person33 city3)
   added: (in person33 plane2)
   goals met: 2 of 39
14. (board person20 plane2 city3)
   deleted: (at person20 city3)
   added: (in person20 plane2)
   goals met: 2 of 39
15. (board person19 plane2 city3)
   deleted: (at person19 city3)
   added: (in person19 plane2)
   goals met: 2 of 39
16. (board person13 plane2 city3)
   deleted: (at person13 city3)
   added: (in person13 plane2)
   goals met: 2 of 39
17. (fly plane3 city1 city4 fl2 fl1)
   deleted: (at_aircraft plane3 city1) (fuel-level plane3 fl2)
   added: (at_aircraft plane3 city4) (fuel-level plane3 fl1)
   goals met: 3 of 39
18. (debark person10 plane3 city4)
   deleted: (in person10 plane3)
   added: (at person10 city4)
   goals met: 4 of 39
19. (fly plane4 city4 city6 fl2 fl1)
   deleted: (at_aircraft plane4 city4) (fuel-level plane4 fl2)
   added: (at_aircraft plane4 city6) (fuel-level plane4 fl1)
   goals met: 4 of 39
20. (debark person9 plane4 city6)
   deleted: (in person9 plane4)
   added: (at person9 city6)
   goals met: 5 of 39
21. (fly plane4 city6 city9 fl1 fl0)
   deleted: (at_aircraft plane4 city6) (fuel-level plane4 fl1)
   added: (at_aircraft plane4 city9) (fuel-level plane4 fl0)
   goals met: 5 of 39
22. (debark person28 plane4 city9)
   deleted: (in person28 plane4)
   added: (at person28 city9)
   goals met: 6 of 39
23. (fly plane1 city0 city8 fl2 fl1)
   deleted: (at_aircraft plane1 city0) (fuel-level plane1 fl2)
   added: (at_aircraft plane1 city8) (fuel-level plane1 fl1)
   goals met: 7 of 39
24. (fly plane5 city0 city5 fl3 fl2)
   deleted: (at_aircraft plane5 city0) (fuel-level plane5 fl3)
   added: (at_aircraft plane5 city5) (fuel-level plane5 fl2)
   goals met: 7 of 39
25. (debark person26 plane5 city5)
   deleted: (in person26 plane5)
   added: (at person26 city5)
   goals met: 8 of 39
26. (fly plane5 city5 city0 fl2 fl1)
   deleted: (at_aircraft plane5 city5) (fuel-level plane5 fl2)
   added: (at_aircraft plane5 city0) (fuel-level plane5 fl1)
   goals met: 8 of 39
27. (fly plane5 city0 city2 fl1 fl0)
   deleted: (at_aircraft plane5 city0) (fuel-level plane5 fl1)
   added: (at_aircraft plane5 city2) (fuel-level plane5 fl0)
   goals met: 8 of 39
28. (fly plane1 city8 city0 fl1 fl0)
   deleted: (at_aircraft plane1 city8) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city0) (fuel-level plane1 fl0)
   goals met: 7 of 39
29. (fly plane2 city3 city2 fl2 fl1)
   deleted: (at_aircraft plane2 city3) (fuel-level plane2 fl2)
   added: (at_aircraft plane2 city2) (fuel-level plane2 fl1)
   goals met: 7 of 39
30. (board person8 plane2 city2)
   deleted: (at person8 city2)
   added: (in person8 plane2)
   goals met: 7 of 39
31. (board person37 plane2 city2)
   deleted: (at person37 city2)
   added: (in person37 plane2)
   goals met: 7 of 39
32. (board person32 plane2 city2)
   deleted: (at person32 city2)
   added: (in person32 plane2)
   goals met: 7 of 39
33. (board person31 plane2 city2)
   deleted: (at person31 city2)
   added: (in person31 plane2)
   goals met: 7 of 39
34. (board person25 plane2 city2)
   deleted: (at person25 city2)
   added: (in person25 plane2)
   goals met: 7 of 39
35. (board person12 plane2 city2)
   deleted: (at person12 city2)
   added: (in person12 plane2)
   goals met: 7 of 39
36. (board person11 plane2 city2)
   deleted: (at person11 city2)
   added: (in person11 plane2)
   goals met: 7 of 39
37. (fly plane3 city4 city9 fl1 fl0)
   deleted: (at_aircraft plane3 city4) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city9) (fuel-level plane3 fl0)
   goals met: 6 of 39
38. (debark person24 plane3 city9)
   deleted: (in person24 plane3)
   added: (at person24 city9)
   goals met: 7 of 39
39. (refuel plane3 city9 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 7 of 39
40. (fly plane3 city9 city1 fl1 fl0)
   deleted: (at_aircraft plane3 city9) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city1) (fuel-level plane3 fl0)
   goals met: 7 of 39
41. (refuel plane3 city1 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 7 of 39
42. (fly plane3 city1 city4 fl1 fl0)
   deleted: (at_aircraft plane3 city1) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city4) (fuel-level plane3 fl0)
   goals met: 8 of 39
43. (refuel plane3 city4 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 8 of 39
44. (fly plane3 city4 city6 fl1 fl0)
   deleted: (at_aircraft plane3 city4) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city6) (fuel-level plane3 fl0)
   goals met: 7 of 39
45. (refuel plane3 city6 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 7 of 39
46. (board person4 plane3 city6)
   deleted: (at person4 city6)
   added: (in person4 plane3)
   goals met: 7 of 39
47. (fly plane3 city6 city4 fl1 fl0)
   deleted: (at_aircraft plane3 city6) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city4) (fuel-level plane3 fl0)
   goals met: 8 of 39
48. (refuel plane3 city4 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 8 of 39
49. (debark person4 plane3 city4)
   deleted: (in person4 plane3)
   added: (at person4 city4)
   goals met: 9 of 39
50. (fly plane3 city4 city9 fl1 fl0)
   deleted: (at_aircraft plane3 city4) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city9) (fuel-level plane3 fl0)
   goals met: 8 of 39
51. (refuel plane3 city9 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 8 of 39
52. (board person34 plane3 city9)
   deleted: (at person34 city9)
   added: (in person34 plane3)
   goals met: 8 of 39
53. (board person27 plane3 city9)
   deleted: (at person27 city9)
   added: (in person27 plane3)
   goals met: 8 of 39
54. (board person22 plane3 city9)
   deleted: (at person22 city9)
   added: (in person22 plane3)
   goals met: 8 of 39
55. (fly plane3 city9 city1 fl1 fl0)
   deleted: (at_aircraft plane3 city9) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city1) (fuel-level plane3 fl0)
   goals met: 8 of 39
56. (refuel plane3 city1 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 8 of 39
57. (debark person27 plane3 city1)
   deleted: (in person27 plane3)
   added: (at person27 city1)
   goals met: 9 of 39
58. (fly plane3 city1 city4 fl1 fl0)
   deleted: (at_aircraft plane3 city1) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city4) (fuel-level plane3 fl0)
   goals met: 10 of 39
59. (refuel plane3 city4 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 10 of 39
60. (debark person22 plane3 city4)
   deleted: (in person22 plane3)
   added: (at person22 city4)
   goals met: 11 of 39
61. (refuel plane1 city0 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 11 of 39
62. (fly plane1 city0 city8 fl1 fl0)
   deleted: (at_aircraft plane1 city0) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city8) (fuel-level plane1 fl0)
   goals met: 12 of 39
63. (fly plane2 city2 city0 fl1 fl0)
   deleted: (at_aircraft plane2 city2) (fuel-level plane2 fl1)
   added: (at_aircraft plane2 city0) (fuel-level plane2 fl0)
   goals met: 12 of 39
64. (debark person12 plane2 city0)
   deleted: (in person12 plane2)
   added: (at person12 city0)
   goals met: 13 of 39
65. (refuel plane2 city0 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 13 of 39
66. (board person7 plane1 city8)
   deleted: (at person7 city8)
   added: (in person7 plane1)
   goals met: 13 of 39
67. (board person16 plane1 city8)
   deleted: (at person16 city8)
   added: (in person16 plane1)
   goals met: 13 of 39
68. (refuel plane1 city8 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 13 of 39
69. (fly plane1 city8 city1 fl1 fl0)
   deleted: (at_aircraft plane1 city8) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city1) (fuel-level plane1 fl0)
   goals met: 12 of 39
70. (debark person16 plane1 city1)
   deleted: (in person16 plane1)
   added: (at person16 city1)
   goals met: 13 of 39
71. (refuel plane1 city1 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 13 of 39
72. (fly plane1 city1 city8 fl1 fl0)
   deleted: (at_aircraft plane1 city1) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city8) (fuel-level plane1 fl0)
   goals met: 14 of 39
73. (fly plane2 city0 city5 fl1 fl0)
   deleted: (at_aircraft plane2 city0) (fuel-level plane2 fl1)
   added: (at_aircraft plane2 city5) (fuel-level plane2 fl0)
   goals met: 14 of 39
74. (debark person33 plane2 city5)
   deleted: (in person33 plane2)
   added: (at person33 city5)
   goals met: 15 of 39
75. (debark person13 plane2 city5)
   deleted: (in person13 plane2)
   added: (at person13 city5)
   goals met: 16 of 39
76. (debark person11 plane2 city5)
   deleted: (in person11 plane2)
   added: (at person11 city5)
   goals met: 17 of 39
77. (refuel plane2 city5 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 17 of 39
78. (board person3 plane2 city5)
   deleted: (at person3 city5)
   added: (in person3 plane2)
   goals met: 17 of 39
79. (board person2 plane2 city5)
   deleted: (at person2 city5)
   added: (in person2 plane2)
   goals met: 17 of 39
80. (board person17 plane2 city5)
   deleted: (at person17 city5)
   added: (in person17 plane2)
   goals met: 17 of 39
81. (board person6 plane1 city8)
   deleted: (at person6 city8)
   added: (in person6 plane1)
   goals met: 17 of 39
82. (board person36 plane1 city8)
   deleted: (at person36 city8)
   added: (in person36 plane1)
   goals met: 17 of 39
83. (refuel plane1 city8 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 17 of 39
84. (fly plane2 city5 city0 fl1 fl0)
   deleted: (at_aircraft plane2 city5) (fuel-level plane2 fl1)
   added: (at_aircraft plane2 city0) (fuel-level plane2 fl0)
   goals met: 17 of 39
85. (refuel plane2 city0 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 17 of 39
86. (debark person17 plane2 city0)
   deleted: (in person17 plane2)
   added: (at person17 city0)
   goals met: 18 of 39
87. (fly plane2 city0 city1 fl1 fl0)
   deleted: (at_aircraft plane2 city0) (fuel-level plane2 fl1)
   added: (at_aircraft plane2 city1) (fuel-level plane2 fl0)
   goals met: 18 of 39
88. (debark person2 plane2 city1)
   deleted: (in person2 plane2)
   added: (at person2 city1)
   goals met: 19 of 39
89. (refuel plane2 city1 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 19 of 39
90. (fly plane2 city1 city7 fl1 fl0)
   deleted: (at_aircraft plane2 city1) (fuel-level plane2 fl1)
   added: (at_aircraft plane2 city7) (fuel-level plane2 fl0)
   goals met: 19 of 39
91. (debark person25 plane2 city7)
   deleted: (in person25 plane2)
   added: (at person25 city7)
   goals met: 20 of 39
92. (debark person19 plane2 city7)
   deleted: (in person19 plane2)
   added: (at person19 city7)
   goals met: 21 of 39
93. (refuel plane2 city7 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 21 of 39
94. (board person35 plane2 city7)
   deleted: (at person35 city7)
   added: (in person35 plane2)
   goals met: 21 of 39
95. (fly plane2 city7 city8 fl1 fl0)
   deleted: (at_aircraft plane2 city7) (fuel-level plane2 fl1)
   added: (at_aircraft plane2 city8) (fuel-level plane2 fl0)
   goals met: 21 of 39
96. (refuel plane2 city8 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 21 of 39
97. (debark person8 plane2 city8)
   deleted: (in person8 plane2)
   added: (at person8 city8)
   goals met: 22 of 39
98. (debark person3 plane2 city8)
   deleted: (in person3 plane2)
   added: (at person3 city8)
   goals met: 23 of 39
99. (fly plane2 city8 city9 fl1 fl0)
   deleted: (at_aircraft plane2 city8) (fuel-level plane2 fl1)
   added: (at_aircraft plane2 city9) (fuel-level plane2 fl0)
   goals met: 23 of 39
100. (debark person37 plane2 city9)
   deleted: (in person37 plane2)
   added: (at person37 city9)
   goals met: 24 of 39
101. (debark person35 plane2 city9)
   deleted: (in person35 plane2)
   added: (at person35 city9)
   goals met: 25 of 39
102. (debark person32 plane2 city9)
   deleted: (in person32 plane2)
   added: (at person32 city9)
   goals met: 26 of 39
103. (debark person31 plane2 city9)
   deleted: (in person31 plane2)
   added: (at person31 city9)
   goals met: 27 of 39
104. (debark person20 plane2 city9)
   deleted: (in person20 plane2)
   added: (at person20 city9)
   goals met: 28 of 39
105. (fly plane3 city4 city7 fl1 fl0)
   deleted: (at_aircraft plane3 city4) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city7) (fuel-level plane3 fl0)
   goals met: 27 of 39
106. (debark person34 plane3 city7)
   deleted: (in person34 plane3)
   added: (at person34 city7)
   goals met: 28 of 39
107. (refuel plane3 city7 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 28 of 39
108. (fly plane3 city7 city4 fl1 fl0)
   deleted: (at_aircraft plane3 city7) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city4) (fuel-level plane3 fl0)
   goals met: 29 of 39
109. (refuel plane3 city4 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 29 of 39
110. (fly plane3 city4 city8 fl1 fl0)
   deleted: (at_aircraft plane3 city4) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city8) (fuel-level plane3 fl0)
   goals met: 28 of 39
111. (refuel plane3 city8 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 28 of 39
112. (debark person5 plane3 city8)
   deleted: (in person5 plane3)
   added: (at person5 city8)
   goals met: 29 of 39
113. (fly plane3 city8 city4 fl1 fl0)
   deleted: (at_aircraft plane3 city8) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city4) (fuel-level plane3 fl0)
   goals met: 30 of 39
114. (fly plane1 city8 city0 fl1 fl0)
   deleted: (at_aircraft plane1 city8) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city0) (fuel-level plane1 fl0)
   goals met: 29 of 39
115. (debark person6 plane1 city0)
   deleted: (in person6 plane1)
   added: (at person6 city0)
   goals met: 30 of 39
116. (debark person36 plane1 city0)
   deleted: (in person36 plane1)
   added: (at person36 city0)
   goals met: 31 of 39
117. (refuel plane1 city0 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 31 of 39
118. (fly plane1 city0 city8 fl1 fl0)
   deleted: (at_aircraft plane1 city0) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city8) (fuel-level plane1 fl0)
   goals met: 32 of 39
119. (refuel plane5 city2 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 32 of 39
120. (fly plane5 city2 city6 fl1 fl0)
   deleted: (at_aircraft plane5 city2) (fuel-level plane5 fl1)
   added: (at_aircraft plane5 city6) (fuel-level plane5 fl0)
   goals met: 32 of 39
121. (refuel plane5 city6 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 32 of 39
122. (board person38 plane5 city6)
   deleted: (at person38 city6)
   added: (in person38 plane5)
   goals met: 32 of 39
123. (board person23 plane5 city6)
   deleted: (at person23 city6)
   added: (in person23 plane5)
   goals met: 32 of 39
124. (fly plane5 city6 city2 fl1 fl0)
   deleted: (at_aircraft plane5 city6) (fuel-level plane5 fl1)
   added: (at_aircraft plane5 city2) (fuel-level plane5 fl0)
   goals met: 32 of 39
125. (refuel plane5 city2 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 32 of 39
126. (refuel plane1 city8 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 32 of 39
127. (fly plane1 city8 city6 fl1 fl0)
   deleted: (at_aircraft plane1 city8) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city6) (fuel-level plane1 fl0)
   goals met: 31 of 39
128. (debark person7 plane1 city6)
   deleted: (in person7 plane1)
   added: (at person7 city6)
   goals met: 32 of 39
129. (refuel plane1 city6 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 32 of 39
130. (fly plane1 city6 city8 fl1 fl0)
   deleted: (at_aircraft plane1 city6) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city8) (fuel-level plane1 fl0)
   goals met: 33 of 39
131. (fly plane5 city2 city3 fl1 fl0)
   deleted: (at_aircraft plane5 city2) (fuel-level plane5 fl1)
   added: (at_aircraft plane5 city3) (fuel-level plane5 fl0)
   goals met: 33 of 39
132. (debark person38 plane5 city3)
   deleted: (in person38 plane5)
   added: (at person38 city3)
   goals met: 34 of 39
133. (refuel plane5 city3 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 34 of 39
134. (fly plane5 city3 city7 fl1 fl0)
   deleted: (at_aircraft plane5 city3) (fuel-level plane5 fl1)
   added: (at_aircraft plane5 city7) (fuel-level plane5 fl0)
   goals met: 34 of 39
135. (debark person23 plane5 city7)
   deleted: (in person23 plane5)
   added: (at person23 city7)
   goals met: 35 of 39
136. (refuel plane5 city7 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 35 of 39
137. (board person30 plane5 city7)
   deleted: (at person30 city7)
   added: (in person30 plane5)
   goals met: 35 of 39
138. (board person29 plane5 city7)
   deleted: (at person29 city7)
   added: (in person29 plane5)
   goals met: 35 of 39
139. (board person18 plane5 city7)
   deleted: (at person18 city7)
   added: (in person18 plane5)
   goals met: 35 of 39
140. (board person15 plane5 city7)
   deleted: (at person15 city7)
   added: (in person15 plane5)
   goals met: 35 of 39
141. (fly plane5 city7 city2 fl1 fl0)
   deleted: (at_aircraft plane5 city7) (fuel-level plane5 fl1)
   added: (at_aircraft plane5 city2) (fuel-level plane5 fl0)
   goals met: 35 of 39
142. (refuel plane5 city2 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 35 of 39
143. (debark person29 plane5 city2)
   deleted: (in person29 plane5)
   added: (at person29 city2)
   goals met: 36 of 39
144. (debark person18 plane5 city2)
   deleted: (in person18 plane5)
   added: (at person18 city2)
   goals met: 37 of 39
145. (fly plane5 city2 city3 fl1 fl0)
   deleted: (at_aircraft plane5 city2) (fuel-level plane5 fl1)
   added: (at_aircraft plane5 city3) (fuel-level plane5 fl0)
   goals met: 37 of 39
146. (refuel plane5 city3 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 37 of 39
147. (debark person15 plane5 city3)
   deleted: (in person15 plane5)
   added: (at person15 city3)
   goals met: 38 of 39
148. (fly plane5 city3 city6 fl1 fl0)
   deleted: (at_aircraft plane5 city3) (fuel-level plane5 fl1)
   added: (at_aircraft plane5 city6) (fuel-level plane5 fl0)
   goals met: 38 of 39
149. (debark person30 plane5 city6)
   deleted: (in person30 plane5)
   added: (at person30 city6)
   goals met: 39 of 39
